{
    "hug":[{
"name":"الأنساك ثلاثة",
"info":[
    "التمتع: وهو الإحرام بالعمرة في أشهر الحج، ويفرغ منها الحاج، ثم يحرم بالحج من مكة أو قربها في يوم التروية وهو الثامن من ذي الحجة.",
"القِران: وهو الإحرام بالعمرة والحج معا، ولا يحل منهما الحاج إلا يوم النحر.",
"الإفراد: وهو الإحرام بالحج من الميقات أو من مكان آخر قبل تجاوز الميقات وفقا لبلد كل حاج، ويبقى على إحرامه حتى يوم النحر."
]
    },
        {
            "name":"الإحرام",
            "info":[
                "إذا أراد أن يحرم بالعمرة، يغتسل ويتطيب، ثم يلبس ثياب الإحرام، وهو عبارة عن إزارا ورداء أبيضين، ولا يظهر الكتف الأيمن إلا في طواف القدوم فقط، أما المرأة تلبس ما تشاء من الثياب بدون أي زينة، ثم يصلي ركعتين، وينوي الإحرام بالعمرة.",
                "ثم يقول لبيك عمرة، لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك، ويرفع الرجل صوته بذلك، أما المرأة تقوله بقدر ما يسمع من بجانبها فقط، ثم يكثرون من التلبية، والذكر."
               ]
        },
        {
            "name":"الطواف",
            "info":[
                "فإذا وصل الحاج مكة، يدخل المسجد الحرام بالقدم اليمنى، ويبدأ 7 أشواط طواف حول الكعبة المشرفة بداية من الحجر الأسود، قائلا بسم الله والله أكبر وكلما مر عليه في كل شوط، وينتهي إليه، ويستلم الحجر بيده اليمنى ويقبله إذا تيسر ذلك، ولا يزاحم عليه، أو يشير إليه من بعيد، ويذكر الله ويدعوه بما يشاء.",
                "وإذا بلغ الركن اليماني استلمه من غير تقبيل، فإذا لم يتيسر له لا يزاحم عليه ولا يشير إليه، ويقول بينه وبين الحجر الأسود ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار.",
               "وأثناء الطواف يقوم الرجل بفعل شيئين، الأول (الاضطباع) وهو إظهار الكتف الأيمن، والثاني (الرمل) وهو الإسراع في المشي مع مقاربة الخطوات أثناء الأشواط الثلاثة الأولى، وفي الباقي يمشي كعادته.",
               "وبعد الانتهاء من الطواف، تقدم نحو مقام إبراهيم واقرأ (واتخذوا من مقام إبراهيم مصلى)، ثم يصلي خلفه ركعتين ويقرأ سورتي (الكافرون) و(الإخلاص) بعد الفاتحة، وإن لم يتيسر ففي أي مكان بالمسجد الحرام."
            ]
            },
        {
            "name":"السعي",
            "info":[
                "ثم يخرج الحاج للسعي من باب الصفا ويصعد عليه مستقبلا الكعبة ويقرأ (إن الصفا والمروة من شعائر الله...) إلى آخر الآية، ويرفع يديه بالدعاء ويحمد الله ويكبره، ويقول (لا إله إلا الله وحده، أنجز وعده، ونصر عبده، وهزم الأحزاب وحده)، ويكررها ثلاث مرات، ولا حرج إن اقتصرت على أقل من ذلك.",
            "ثم ينزل من الصفا إلى المروة ماشيا، فإذا بلغ العلمين الأخضرين يسرع في مشيه (الهرولة) وهذا للرجال فقط، ويمشي كعادته عند الوصول للعلم الثاني، ويكرر الأمر في كل شوط، ويصعد على المروة ويقول ما قاله على الصفا، ويحسب الشوط من الصفا إلى المروة والعكس يحسب شوطا آخر، ويقول في السعي ما تيسر من الذكر والدعاء أو قراءة القرآن."  ,
            "فإذا أتم سعيه يحلق الرجل رأسه أو يقصر فقط ليبقى الرأس للحلق للحج، بحيث لو كانت المدة قريبة للحج لا يتسع الوقت لنبات شعر الرأس، وإن كانت إمرأة تقصر من أطراف شعرها قدر أنملة في جميع جهات الرأس.",
            "وبذلك تمت العمرة ويحل من الإحرام كاملا وترفع المحظورات، وتحل له الملابس والطيب والنكاح، وغير ذلك.",
            "ولكن في حالة الحج المتمتع، وجب عليك هدي يوم النحر بـ (شاة)، أو سبع بدنة أو بقرة، فإن لم تجد فعليك صيام 10 أيام، ثلاثة منهم قبل يوم عرفة في الحج، وسبعة إذا رجعت إلى أهلك."
            
            ]
        },
        {
            "name":"يوم التروية بـ (منى)",
            "info":[
                "وهو الثامن من ذي الحجة، حيث يحرم الحاج المتمتع من مكانه، ويفعل عند إحرامه بالحج مثل الإحرام للعمرة من الغسل، والتطيب، والصلاة، ولبس الإحرام، ثم ينوي الإحرام بالحج ويلبي قائلا: (لبيك حجاً، لبيك اللهم لبيك ...) إلى آخر التلبية.",
                "ويخرج الحاج إلى منى، ويصلي بها الظهر والعصر والمغرب والعشاء والفجر، قصرا (الصلاة الرباعية تصلى ركعتين)، في أوقاتها دون جمع."

               ]
        },
        {
            "name":"يوم عرفة",
            "info":[
                "فإذا طلعت شمس التاسع من ذي الحجة (يوم عرفة)، يسير الحاج إلى عرفات، ويصلي بها الظهر والعصر جمع تقديم قصرا أي بأذان واحد وإقامتين، ثم يتفرغ بعد الصلاة للذكر والدعاء بما تيسر، رافعا يديه مستقبلا القبلة، إلى أن تغيب الشمس، ولا يشرع للحاج صعود جبل الرحمة الموجود بعرفة."
                
               ]
        },
        {
            "name":"المبيت بمزدلفة ورمي جمرة العقبة",
            "info":[
                "وإذا غربت الشمس، يسير الحاج إلى المزدلفة في سكينة ملبيا، ويصلي بها المغرب والعشاء جمعا وقصرا، ويبيت بها إلى أن يصلي الفجر في اليوم العاشر من ذي الحجة أول أيام عيد الأضحى المبارك.",
                "وقبل طلوع شمس اليوم العاشر يسير الحجاج إلى (منى) مع أخذ 7 حصيات من مزدلفة، لرمي جمرة العقبة بها متعاقبات ويكبر مع كل حصاة، وحجمها يعادل الحمصة تقريبا، أما باقي الحصى فالتقطه من منى."

               ]
        },
        {
            "name":" الهدي والتحلل الأول",
            "info":[
                "فإذا فرغ يذبح الحاج الهدي، ويأكل منه، ثم يحلق رأسه إن كان رجلا، أما المرأة تقصر فقط من أطراف شعرها بقدر أنملة، وبذلك يتم التحلل الأول، والذي يسمح بعدها بلبس الثياب ورفع محظورات الإحرام، سوى النساء."
               ]
        },
        {
            "name":"طواف الإفاضة",
            "info":[
                "ثم ينزل الحجاج إلى مكة لطواف الإفاضة بالبيت الحرام، والسعي إن كان متمتعا أو لم يسع مع طواف القدوم إن كنت قارنا أو مفردا، وبهذا تحل لك النساء، ويجوز تأخير طواف الإفاضة إلى ما بعد أيام منى، والنزول إلى مكة بعد الفراغ إلى رمي الجمار."
               ]
        },
        {
            "name":" رمي الجمرات في أيام التشريق",
            "info":[
                "ثم بعد الطواف والسعي يرجع إلى منى، فيبيت أيام التشريق الثلاثة، وهي الحادي عشر، والثاني عشر والثالث عشر من ذي الحجة، ويرمي الجمرات الثلاث، في يومين أو ثلاثة، ويبدأ بالجمرة الأولى وهي الأبعد عن مكة، ثم الوسطى، ثم جمرة العقبة، كل واحدة بـ 7 حصيات متعاقبة وتكبر مع كل حصاة، وبعد أن يرمي عند كل جمرة يدعو بما تيسر، وبعد جمرة العقبة ينصرف ولا يدعو."
               ]
        },
        {
            "name":"طواف الوداع وإتمام الحج",
            "info":[
                "وإذا أراد الحاج العودة إلى بلده لا يخرج من مكة إلا بعد طواف الوداع بالكعبة المشرفة، ولا يعفى من ذلك أحدا إلا الحائض والنفساء، لقوله (صلى الله عليه وسلم): لا ينفر أحدا حتى يكون آخر عهده بالبيت"
               ]
        },
        {
            "name":" زيارة المسجد النبوي الشريف",
            "info":[
                "زيارة مسجد الرسول (صلى الله عليه وسلم) في المدينة المنورة ليس من الحج والعمرة، حيث يتوجه الحاج إلى المدينة قبل أداء المناسك أو بعدها، بنية زيارة المسجد النبوي والصلاة فيه، لأنها خير من ألف صلاة فيما سواه إلا المسجد الحرام.",
                "فإذا وصلت المسجد فصل فيه ركعتين تحية المسجد أو صلاة الفريضة إن كانت قد أقيمت، ثم اذهب إلى قبر الرسول (صلى الله عليه وسلم)، وسلم عليه قائلا: (السلام عليك أيها النبي ورحمة الله وبركاته)",
                "ثم أخط عن يمينك خطوتين لتقف أمام قبر أبي بكر الصديق (رضي الله عنه)، قائلا (السلام عليك يا أبا بكر خليفة رسول الله ورحمة الله وبركاته، رضي الله عنك وجزاك عن أمة محمد خيرا)",
"ثم أخط خطوتين لتقف أمام قبر الفاروق عمر بن الخطاب (رضي الله عنه)، قائلا (السلام عليك يا عمر أمير المؤمنين ورحمة الله وبركاته، رضي الله عنك وجزاك عن أمة محمد خير)",
"ويسن لك أن تزور مسجد قباء وتصلي فيه، كما تخرج تزور أهل البقيع وقبر عثمان بن عفان (رضي الله عنه)، وشهداء أحد، وقبر حمزة بن عبدالمطلب (رضي الله عنه)، وتدعو لهم."
               ]
        }
    ]
}