{
    "praise":[
        {
            "name":"سبحان الله",
           "info":"فتَسبيحُ اللَّه أصلٌ عظيمٌ من أصولِ التَّوحيد، ورُكنٌ أساسيٌّ من أركان الإيمان بالله عزَّ وجلَّ وإثبات الأسماء الحُسنَى والصِّفات العُلى، وذكر عظيمٌ لِله تعالى لا يصلُح لغيره.",
          
            "mening":"يقول شيخ الإسلام ابن تيمية رحمه الله : ( والأمر بتسبيحه يقتضي أيضا تنزيهه عن كل عيب وسوء ، وإثبات صفات الكمال له ، فإن التسبيح يقتضي التنزيه ، والتعظيم ، والتعظيم يستلزم إثبات المحامد التي يحمد عليها ، فيقتضي ذلك تنزيهه ، وتحميده ، وتكبيره ، وتوحيده )"
        },
        {
            "name":"الحمد لله",
           "info":"الحمد لله كلمةٌ من أحسن الكلمات التي يُعمر بها الجَنان، وينطق بها اللسان، وتسمعها الأذنان، وتخطُّها للحقِّ البَنان ومن أطيب ما تعطرت بلفظه الأفواه، واستراحت به النفوس، وكثرت به الأجور، وارتفعت به المنزلة عند الله رب العالمين",
            "mening":"إن المسلم إذا نزلت عليه نعم الله تعالى، وأحاط به فضله سارع إلى حمد الله تعالى على ذلك؛ شكراً لربه، ورجاء لبقاء نعمته عليه. وقد ورد في كتاب الله تعالى وسنة رسوله عليه الصلاة والسلام بعض الأحوال التي يستحب فيها حمد الله تعالى؛ فمن ذلك ( حينما يصبح المسلم وحين يمسي و إذا أقبل على النوم، وإذا استيقظ منه و عندما يرى المسلم في منامه ما يحب من الرؤى فإنه يحمد الله و وإذا رأى في نفسه نعمة فاق بها غيره وإذا عطس العطاس الطبيعي ) فحمد الله صدقًا من القلب واللسان يزيد الإيمان، ويأتي بالثواب الذي يثقل الميزان، ويغفر الذنوب، ويجلب النعم، ويصرف النقم، ويورث صاحبه الاطمئنان، ويوصله إلى محبة الله ورضوانه"
        },
       
        {
            "name":"لا إله إلا الله",
            "info":"لا إله إلا الله هي أفضل الكلام بعد القرآن، هي أحب الكلام إلى الله، وأفضل الكلام، وهي كلمة الإخلاص، وهي أول شيء دعت إليه الرسل عليهم الصلاة والسلام، وأول شيء دعا إليه النبي ﷺ أن قال لقومه:  ( قولوا: لا إله إلا الله تفلحوا )، هي كلمة الإخلاص كلمة التوحيد.",
        "mening":"ومعناها: لا معبود حق إلا الله، هذا معناها كما قال تعالى: (ذَلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ هُوَ الْبَاطِلُ) [الحج:62]، وهي نفي وإثبات، (لا إله) نفي و(إلا الله) إثبات، (لا إله) تنفي جميع المعبودات وجميع الآلهة بغير حق، و(إلا الله) تثبت العبادة بالحق لله وحده ، فهي أصل الدين وأساس الملة."
        },
       
        {
            "name":"الله اكبر",
           "info":"التكبير في جميع الأوقات، لأنه من الذكر المطلق ",
           
            "mening":"معناها: ان الله أكبر من كل شيء في ذاته واسمائه وصفاته وكل ما تحتمله هذه الكلمة من معنى، فكل معنى لهذه الكلمة من معاني الكبرياء فهو ثابت لله عز وجل"
        },
        {
            "name":"لا حول ولا قوة الا بالله العلي العظيم",
            "info":"من حديث أبي موسى الأشعري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال له:   يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ ، قُلْتُ : لَبَّيْكَ يَا رَسُولَ اللَّهِ ، قَالَ : أَلَا أَدُلُّكَ عَلَى كَلِمَةٍ مِنْ كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ ؟ قُلْتُ : بَلَى ، يَا رَسُولَ اللَّهِ ، فَدَاكَ أَبِي وَأُمِّي قَالَ: لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ .",
            "mening":"وجاء في معنى الحول، بأنه الحركة والحيلة أي لا حركة ولا استطاعة ولا حيلة إلا بمشيئة الله تعالى. وقيل: معناه لا حول في دفع شر ولا قوة في تحصيل خير إلا بالله. وقيل: لا حول عن معصية الله إلا بعصمته ولا قوة على طاعته إلا بمعونته وحُكي هذا عن ابن مسعود رضي الله عنه وكله متقارب"
        },
        {
            "name":"اذكر الله",
            "mening":" أفضل ما يَشغل العبد به وقته، هو ذكر الله -تعالى-، تلك العبادة السهلة الميسورة التي رتَّب الله -تعالى- عليها الأجر الكبير والثواب الجزيل، وهو ما ينفع المسلم في الدنيا والآخرة، وفي يأتي بيانٌ لفضائل كَثرة ذكر الله -تعالى-",
            "info":"تقوم عبادة ذكر الله -تعالى- على التِّكرار بالقلب واللسان؛ فقد ثبت في القرآن الكريم والسنة النبوية أدعيةٌ وأذكارٌ فيها تعظيمٌ لله وثناءٌ عليه، لذا فقد كانت هذه الأعمال هي أحبُّ الأعمال إلى الله -عزَّ وجلّ-؛ لما فيها من تسخير العبد نفسه لتعظيم الله"
        }
        
    ]
}

