{
    "salah":[
        {
            "name":"الوضوء",
            "info":[
                "النية والبسملة",
                "غسل الكفين\nبعد أن ينوي المسلم الوضوء بقلبه ويُسمِّ الله يقوم بغسل الكفّين ثلاث مرات، ولا يُعَدُّ غسل الكفّين من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ)، فبدأ بالوجه ولم يَذكَر غسل الكفّين، فغسلُ الكفين يُعَدُّ سنّة من سنن الوضوء لفعل رسول الله -صلّى الله عليه وسلّم- ذلك، فعن حذيفة بن أوسٍ الثقفيّ قال: (رأيتُ رسولَ اللهِ صلَّى اللهُ عليه وسلم استوكفَ ثلاثًا)،أيّ غسل كفّيه ثلاثاً",
                "المضمضة\nبعد أن يغسل المتوضّئ كفّيه يقوم بالمضمضة؛ وهي أن يأخذ حفنةً من الماء و يحرِّكه في فمه ثلاث مرّات، ويليها الاستنشاق؛ وهو أن يأخذ الماء من كفّيه بقوة النَّفس ثلاث مرات، ثمّ الاستنثار؛ وهو إخراج الماء الذي أدخله بالاستنشاق وهو يدفع نَفَسَهُ ثلاث مرات.",
                "غسل الوجه\n بعد أن يتمضمض المتوضّئ ويستنشق ويستنثر يأتي غسل الوجه ثلاثاً؛ وهو واجب من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ)، وغسل الوجه يكون من حدود الوجه من الأعلى إلى الأسفل؛ أيّ من منبت الشعر إلى الذّقن، وإن كان للرّجل لحية كثيفة يقوم بتخليلها بالماء.",
                "غسل اليدين إلى المِرفقين\n بعد غسل الوجه يقوم المتوضّئ بغسل اليدين إلى المِرفقين وهو من واجبات الوضوء فلا يصحُّ الوضوء إلّا به، قال -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ)، ويبدأ غسل اليدين ابتداءً من أطراف الأصابع حتى يصل إلى المرفقين ثلاثاً.",
                "مسح الرأس\nبعد غسل اليدين إلى المِرفقين يأتي مسح الرأس، وهو واجب من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ)، وكيفيّة المسح تكون من مقدّمة الرّأس حتى مؤخرته ويعود ماسحاً من مؤخّرة رأسه إلى المقدمة، ويجوز المسح من مقدمة الرّأس إلى مؤخّرته فقط والمرأة كذلك، ولا تمسح المرأةُ على ظفائرها.",
                "مسح الأذنين\nبعد مسح الرأس يأتي مسح الأذنين ويكون بمسح الأذنين ظاهرهما وباطنهما",
                "غسل القدمين مع الكعبين\nيأتي بعد مسح الأذنين غسل القدمين مع الكعبين، وهو من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ) وكلمة وَأَرْجُلَكُمْ جاءت معطوفةً على وُجُوهَكُمْ و أَيْدِيَكُمْ، فيكون المعنى: فاغسلوا وجهكم وأيديكم وأرجلكم إلى الكعبين. ويؤيّد ذلك قول رسول الله -صلّى الله عليه وسلّم-: (ويلٌ للأعقابِ وبطونِ الأقدامِ من النارِ)، فمن الواجب غسل القدمين من رؤوس الأصابع حتى الكعبين ولا يقلل من ذلك، قد توعّد رسول الله -صلّى الله عليه وسلّم- من يفعل ذلك بالنّار.",
                "ترديد دعاء ما بعد الوضوء وهو: (اللهمَّ اجْعَلْني من التَّوابينَ، واجْعَلْني من المُتطهِّرينَ)",
                "نواقض الوضوء\nالخارج من السبيلين، وهو وحده المتفق على أنه ينقض الوضوء، ويشمل كل خارج من القبل أو الدبر، من: ريح، أو بول، أو براز، أو مني، أو مذي، أو ودي.",
                " التيمم الصحيحة\nيضرب التراب بيديه ضربة واحدة ثم يمسح بهما وجهه وكفيه، كما في الصحيحين أن النبي ﷺ قال لعمار بن ياسر (إنما يكفيك أن تقول بيديك هكذ) ثم ضرب بيديه الأرض ومسح بهما وجهه وكفيه . ويشترط أن يكون التراب طاهرًا.",
                "الغسل من الجنابة\nيغسل كفيه قبل إدخالهما في الإناء ثم يفرغ بيمينه على شماله فيغسل فرجه، ثم يتوضأ وضوءه للصلاة كاملاً أو يؤخر غسل الرجلين إلى آخر الغسل، ثم يفرق شعر رأسه فيفيض ثلاث حثيات من ماء، حتى يروى كله، ثم يفيض الماء على شقه الأيمن، ثم يفيض الماء على شقه الأيسر، هذا هو الغسل الأكمل والأفضل، ودليله ما في الصحيحين من حديث ابن عباس عن خالته ميمونة ـ رضي الله عنهما ـ قالت: أدنيت لرسول الله صلى الله عليه وسلم غسله من الجنابة، فغسل كفيه مرتين أو ثلاثاً، ثم أدخل يده في الإناء، ثم أفرغ به على فرجه وغسل بشماله، ثم ضرب بشماله الأرض فدلكها دلكاً شديداً، ثم توضأ وضوءه للصلاة، ثم أفرغ على رأسه ثلاث حفنات ملء كفه، ثم غسل سائر جسده، ثم تنحى عن مقامه ذلك فغسل رجليه، ثم أتيته بالمنديل فرده."
   
            ]
        }
      
    ]
}