{
    "salah":[
        {
            "name":"الوضوء",
            "info":[
                "النية والبسملة",
                "غسل الكفين\nبعد أن ينوي المسلم الوضوء بقلبه ويُسمِّ الله يقوم بغسل الكفّين ثلاث مرات، ولا يُعَدُّ غسل الكفّين من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ)، فبدأ بالوجه ولم يَذكَر غسل الكفّين، فغسلُ الكفين يُعَدُّ سنّة من سنن الوضوء لفعل رسول الله -صلّى الله عليه وسلّم- ذلك، فعن حذيفة بن أوسٍ الثقفيّ قال: (رأيتُ رسولَ اللهِ صلَّى اللهُ عليه وسلم استوكفَ ثلاثًا)،أيّ غسل كفّيه ثلاثاً",
                "المضمضة\nبعد أن يغسل المتوضّئ كفّيه يقوم بالمضمضة؛ وهي أن يأخذ حفنةً من الماء و يحرِّكه في فمه ثلاث مرّات، ويليها الاستنشاق؛ وهو أن يأخذ الماء من كفّيه بقوة النَّفس ثلاث مرات، ثمّ الاستنثار؛ وهو إخراج الماء الذي أدخله بالاستنشاق وهو يدفع نَفَسَهُ ثلاث مرات.",
                "غسل الوجه\n بعد أن يتمضمض المتوضّئ ويستنشق ويستنثر يأتي غسل الوجه ثلاثاً؛ وهو واجب من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ)، وغسل الوجه يكون من حدود الوجه من الأعلى إلى الأسفل؛ أيّ من منبت الشعر إلى الذّقن، وإن كان للرّجل لحية كثيفة يقوم بتخليلها بالماء.",
                "غسل اليدين إلى المِرفقين\n بعد غسل الوجه يقوم المتوضّئ بغسل اليدين إلى المِرفقين وهو من واجبات الوضوء فلا يصحُّ الوضوء إلّا به، قال -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ)، ويبدأ غسل اليدين ابتداءً من أطراف الأصابع حتى يصل إلى المرفقين ثلاثاً.",
                "مسح الرأس\nبعد غسل اليدين إلى المِرفقين يأتي مسح الرأس، وهو واجب من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ)، وكيفيّة المسح تكون من مقدّمة الرّأس حتى مؤخرته ويعود ماسحاً من مؤخّرة رأسه إلى المقدمة، ويجوز المسح من مقدمة الرّأس إلى مؤخّرته فقط والمرأة كذلك، ولا تمسح المرأةُ على ظفائرها.",
                "مسح الأذنين\nبعد مسح الرأس يأتي مسح الأذنين ويكون بمسح الأذنين ظاهرهما وباطنهما",
                "غسل القدمين مع الكعبين\nيأتي بعد مسح الأذنين غسل القدمين مع الكعبين، وهو من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ) وكلمة وَأَرْجُلَكُمْ جاءت معطوفةً على وُجُوهَكُمْ و أَيْدِيَكُمْ، فيكون المعنى: فاغسلوا وجهكم وأيديكم وأرجلكم إلى الكعبين. ويؤيّد ذلك قول رسول الله -صلّى الله عليه وسلّم-: (ويلٌ للأعقابِ وبطونِ الأقدامِ من النارِ)، فمن الواجب غسل القدمين من رؤوس الأصابع حتى الكعبين ولا يقلل من ذلك، قد توعّد رسول الله -صلّى الله عليه وسلّم- من يفعل ذلك بالنّار.",
                "ترديد دعاء ما بعد الوضوء وهو: (اشهد ان لا اله إلا الله وحده لا شريك له و ان محمدا عبده و رسوله ، اللهم اجعلني من التوابين و اجعلني من المتطهرين)",
                "نواقض الوضوء\nالخارج من السبيلين، وهو وحده المتفق على أنه ينقض الوضوء، ويشمل كل خارج من القبل أو الدبر، من: ريح، أو بول، أو براز، أو مني، أو مذي، أو ودي.",
                " التيمم الصحيحة\nيضرب التراب بيديه ضربة واحدة ثم يمسح بهما وجهه وكفيه، كما في الصحيحين أن النبي ﷺ قال لعمار بن ياسر (إنما يكفيك أن تقول بيديك هكذ) ثم ضرب بيديه الأرض ومسح بهما وجهه وكفيه . ويشترط أن يكون التراب طاهرًا.",
                "الغسل من الجنابة\nيغسل كفيه قبل إدخالهما في الإناء ثم يفرغ بيمينه على شماله فيغسل فرجه، ثم يتوضأ وضوءه للصلاة كاملاً أو يؤخر غسل الرجلين إلى آخر الغسل، ثم يفرق شعر رأسه فيفيض ثلاث حثيات من ماء، حتى يروى كله، ثم يفيض الماء على شقه الأيمن، ثم يفيض الماء على شقه الأيسر، هذا هو الغسل الأكمل والأفضل، ودليله ما في الصحيحين من حديث ابن عباس عن خالته ميمونة ـ رضي الله عنهما ـ قالت: أدنيت لرسول الله صلى الله عليه وسلم غسله من الجنابة، فغسل كفيه مرتين أو ثلاثاً، ثم أدخل يده في الإناء، ثم أفرغ به على فرجه وغسل بشماله، ثم ضرب بشماله الأرض فدلكها دلكاً شديداً، ثم توضأ وضوءه للصلاة، ثم أفرغ على رأسه ثلاث حفنات ملء كفه، ثم غسل سائر جسده، ثم تنحى عن مقامه ذلك فغسل رجليه، ثم أتيته بالمنديل فرده."
            ]
        },
        {
            "name":"كيف اصلي",
            "info":[
"قبل البدء بالصلاة ينبغي أن يكون الإنسان على وضوء",
"يستقبل القبلة، ويرفع اليدين بمحاذاة الأذنين، ويكبر للإحرام بالقول (الله أكبر)، ومن ثم يضع الكف اليمنى فوق اليسرى على الصدر، ثم يقرأ دعاء الاستفتاح: (اللهم باعد بيني و بين خطاياي كما بعدت بين المشرق و المغرب ، اللهم نقني من خطاياي كما ينقي الثوب الأبيض من الدنس،  اللهم أغسلني من خطاياي بالماء و الثلج و البرد ، سبحانك اللهم و بحمدك و تبارك اسمك و تعالي جدك ولا اله غيرك). وهذا الدعاء لا يقرأ إلا مرة واحدة فقط بعد تكبيرة الإحرام في بداية الصلاة.",
"يتعوذ المصلي بالله من الشيطان الرجيم، ثم يتلو سورة الفاتحة، ويقول آمين، ويلحقها بما تيسر من آي الذكر الحكيم.",
"يركع بحيث يصير ظهره موازياً للأرض، ويضع يديه على ركبتيه، حيث يقول المصلي أثناء الركوع: (سبحان ربي العظيم) ثلاث مرات.",
"يعتدل من الركوع ويقول (سمع الله لمن حمده)،ويرفع اليدين بمحاذاة الأذنين، ثم يقول (ربنا ولك الحمد حمداً كثيراً طيباً مباركاً فيه).",
"يسجد بحيث تلامس أجزاؤه الثمانية الأرض وهذه الأجزاء هي: الكفان، والركبتان، وأطراف أصابع القدمين، بالإضافة إلى الأنف، والجبهة. *يقول المصلي أثناء السجود: (سبحان ربي الأعلى) ثلاث مرات.",
"يرتفع من سجوده وهو يقول الله أكبر، ثم يجلس بين السجدتين ويقول (اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاجْبُرْنِي، وَاهْدِنِي، وَارْزُقْنِي) ثلات مرات، ويعاود السجود مرة أخرى",
"بعد السجدة الثانية، إن كان المصلي في الركعة الثانية أو الأخيرة من الصلاة يستمر في جلوسه، ثم يتشهد فيقول: (التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمداً عبده ورسوله)، ثم يقرأ الصلاة الإبراهيمية: (اللهم صلِّ على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد)، وإن كان في الركعة الثانية توقف عند التشهد، ويرفع اليدين بمحاذاة الأذنين، ووقف،ثم يقراء سوره الفاتحه فقط وياكمل صلاته إلى نهايتها، أما لو كان جالساً في آخر ركعة فإنه يسلم بعد الصلاة الإبراهيمية، حيث يدير رأسه على اليمين ويقول: (السلام عليكم ورحمة الله وبركاته)، ثم يدير رأسه على اليسار ويقول: (السلام عليكم ورحمة الله)، أما لو لم يكن في الركعة الثانية أو الأخيرة من الصلاة فينهض بعد السجدة الثانية ويعيد الخطوات السابقة."
            ]
        },
        {
            "name":"صلاة الفريضه",
            "info":[
                "عند البدء بصلاة الفرض أنّه ينوي صلاة الفريضة إماماً أو مأموماً أو مُنفرداً",
                "صلاة الفجر\nعداد الركعات : 2 \nعداد ركعات السنه : 2\nركعتين قبل الفجر",
                "صلاة الظهر \nعداد الركعات : 4 \nعداد ركعات السنه : 6 \n 4  قبل الظهر وركعتين بعد الظهر",
                "صلاة العصر \nعداد الركعات : 4 \nعداد ركعات السنه : 0",
                "صلاة المغرب \nعداد الركعات: 3 \n عداد ركعات السنه : 2\nركعتين بعد المغرب ",
                "صلاه العشاء\nعداد الركعات: 4 \nعداد ركعات السنه : 2 \nركعتين بعد العشاء"
            ]
        },
        {
            "name":"صلاة القيام",
            "info":[
                "تُؤدّى صلاة قيام الليل ركعتَين ركعتَين؛ لِما ثبت ذلك في السنّة النبويّة عن عبدالله بن عمر -رضي الله عنهما- أنّ النبيّ -عليه الصلاة والسلام- قال: (صَلاةُ اللَّيْلِ مَثْنَى مَثْنَى، فإذا رَأَيْتَ أنَّ الصُّبْحَ يُدْرِكُكَ فأوْتِرْ بواحِدَةٍ. فقِيلَ لاِبْنِ عُمَرَ: ما مَثْنَى مَثْنَى؟ قالَ: أنْ تُسَلِّمَ في كُلِّ رَكْعَتَيْنِ)، وقال أيضاً: (أنَّ رسولَ اللهِ صلَّى اللهُ تعالَى عليه وسلم قال: صلاةُ الليلِ والنهارِ مثنَى مثنَى).",
                "ويُستحسن بالمسلم خَتْم قيام الليل بأداء الوتْر، كما ورد في صحيح البخاريّ أنّ النبيّ -عليه الصلاة والسلام-: (اجْعَلُوا آخِرَ صَلَاتِكُمْ باللَّيْلِ وِتْرًا)،والتسليم مطلوبٌ بين الركعتين في صلاة القيام، ولا تكون الصلاة على شكل صلاتي الظُّهر، أو العصر؛ اقتداءً بفَعْل النبيّ -عليه الصلاة والسلام ",
                "استناداً لما أخرجه الإمام مُسلم في صحيحه، عن أمّ المؤمنين عائشة -رضي الله عنها- أنّها قالت: (كانَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ يُصَلِّي فِيما بيْنَ أَنْ يَفْرُغَ مِن صَلَاةِ العِشَاءِ، وَهي الَّتي يَدْعُو النَّاسُ العَتَمَةَ، إلى الفَجْرِ، إحْدَى عَشْرَةَ رَكْعَةً، يُسَلِّمُ بيْنَ كُلِّ رَكْعَتَيْنِ، وَيُوتِرُ بوَاحِدَةٍ، فَإِذَا سَكَتَ المُؤَذِّنُ مِن صَلَاةِ الفَجْرِ، وَتَبَيَّنَ له الفَجْرُ، وَجَاءَهُ المُؤَذِّنُ، قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ اضْطَجَعَ علَى شِقِّهِ الأيْمَنِ، حتَّى يَأْتِيَهُ المُؤَذِّنُ لِلإِقَامَةِ)."
            ]
        },
        {
            "name":"صلاة الضحي",
            "info":[
"تؤدى بعد طلوع الشمس بنحو 20 دقيقة إلى قبيل الظهر، وحكم صلاة الضحى أنها سنة مؤكدة عند الجمهور، وأقلها ركعتان، وأوسطها أربع ركعات، وأفضلها ثماني ركعات، وأكثرها اثنتا عشرة ركعة، وفضلها تعد صدقة عن مفاصل الجسم البالغة نحو 360 مفصلًا، وذكر بعض العلماء أن الرسول -صلى الله عليه وسلم- كان يصلي صلاة الضحى، ولكنه لا يداوم عليها، خشية أن يعمل الناس مثله فتفرض عليهم، وأنه كان منشغلاً بقيام الليل الذي كان فرضًا عليه كما ذهب إلى ذلك بعض العلماء."
            ]
        },
        {
            "name":"صلاة الاستخارة",
            "info":[
              "الاستخارة في اللغة طَلَبُ الخِيَرَةِ فِي الشَّيْءِ وصلاة الاستخارة هي طَلَبُ الخِيَرَةِ من الله عز وجل، فإن كان المسلم في حاجة لاختيار بين شيئين وصلى الاستخارة واختار أحدهم وتيسر وحدث ذلك الشي فهو الخير، وإن تعطل ولم يحدث فهو أيضاً الخير له. وهي عبادة في الإسلام، لا وقتاً محدداً لها.",
              "وتكون بأن يصلي المسلم ركعتين من غير الفريضة ويسلم، ثم يحمد الله ويصلي على نبيه، ثم يدعو بنص الدعاء الذي رواه الإمام البخاري:",
              "«اللهُمَّ إنِّي أسْتَخيرُكَ بعِلْمِكَ، وأسْتَقْدِرُكَ بقُدْرَتِكَ، وأسْألُكَ مِنْ فضلِكَ العَظِيم، فإنَّكَ تَقْدِرُ ولا أقْدِرُ، وتَعْلَمُ ولا أعْلَمُ، وأنْتَ عَلاَّمُ الغُيوبِ، اللهُمَّ إنْ كُنْتَ تَعْلَمُ أن هذَا الأمرَ -ويسمي الشيء الذي يريده- خَيرٌ لي في دِيني ومَعَاشي وعَاقِبَةِ أمْري عَاجِلهِ وآجِلِهِ فاقْدُرْهُ لي ويَسِّرْهُ لي، ثمَّ بَارِكْ لي فيهِ، وإنْ كُنْتَ تَعْلَمُ أنَّ هذا الأمْرَ شَرٌّ لي في دِينِي ومَعَاشي وعَاقِبَةِ أمري عَاجِلِهِ وآجِلِهِ فَاصْرِفْهُ عَنِّي، وَاصْرِفْنِي عَنْهُ، واقْدُرْ لِيَ الخَيْرَ حَيْثُ كَانَ، ثُمَّ أرْضِنِي بِهِ.»",
              "يعتقد العامة بأن لصلاة الاستخارة رؤيا بعدها، تكون بشارة لتحقق الأمر أو نحوه وهذا خطأ شائع فلا رؤيا ولا أحلام أو منامات أو غيره بل تتوكل على الله في أداء الأمر قال الله تعالى: ﴿فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللّهِ﴾ فإن هيأ الله لك الأمر وسددك فيه وسهله لك فهو كذلك وإن أبعدك عنه فهذا قدر الله تعالى.",
              "شروط الاستخارة\nالنية.\nالاخذ بالأسباب.\nالرضا بقضاء الله.\nالاستخارة في الأمور المباحة فقط.\nالتوبة، رد المظالم، عدم الكسب أو المأكل من حرام.\nأن تستخير في أي شيء حتى لو تمكن هذا الأمر منك وصار عندك الميل والرغبة في الأمر."
            ]
        },
        {
            "name":"صلاة العيد",
            "info":[
                "شرع الإسلام صلاة العيدين الصلاة الأولى في 1 شوال هجرياً من كل عام والثانية في 10 ذو الحجة هجرياً من كل عام، في السنة الأولى من الهجرة وهي: فرض كفاية عند الحنابلة، والإمامية، وسنة مؤكدة عند المالكية، والشافعية؛ وواجبة عند الحنفية. وتكون الصلاة في صباح أول أيام عيدي الأضحى والفطر، وثبت في الحديث: أن النبي محمد ﷺ واظب عليها، وأمر الرجال والنساء أن يخرجوا لها، وصلاة العيد ركعتان، يشرع فيها التكبير، وبعدها خطبه واحده .",
                "يدخل وقتها بعد ارتفاع الشمس قدر رمح، وحدده العلماء بزوال حمرتها، وينتهي وقتها بزوال الشمس.",
                "من آداب صلاة العيد يستحب الغسل والتطيب ولبس أجمل الثياب، ويستحب في عيد الفطر الإفطار بعد صلاة الفجر مباشرة، بأكل بعض تمرات أو نحوها قبل الخروج إلى الصلاة، أما في عيد الأضحى فيستحب الإمساك بعد صلاة الفجر إلى وقت النحر، وأداء الصلاة في العراء (المصلى) أفضل من تأديتها في المساجد إن أمكن وإلا فلا حرج في فعلها في المساجد",
                "ومن صفة صلاة العيد أن يحضر الإمام ويئِمُ الناس بركعتين يُكبر في الأولى تكبيرة الإحرام، ثم يُكبر بعدها ست تكبيرات أو سبع تكبيرات لحديث عائشة رضي الله عنها: (التكبير في الفطر والأضحى الأولى سبع تكبيرات وفي الثانية خمس تكبيرات سوى تكبيرتي الركوع).",
                "ثم يقرأ الفاتحة، ويقرأ سورة ق في الركعة الأولى، وفي الركعة الثانية يقوم مُكبراً فإذا انتهى من القيام يُكبر خمس تكبيرات، ويقرأ سورة الفاتحة، ثم سورة القمر (اقتربت الساعة وانشق القمر) فهاتان السورتان كان النبي محمد عليه الصلاة والسلام يقرأ بهما في العيدين، وإن شاء قرأ في الأولى سورة الأعلى وفي الثانية سورة الغاشية بـ (هل أتاك حديث الغاشية) فقد ورد عن النبي محمد أنه كان يقرأ في العيد سبح اسم ربك الأعلى والغاشية.",
                "وبعد الصلاة يخطب الإمام في الناس، وينبغي أن يخص شيئاً من الخطبة يوجهه إلى النساء يأمرهن بما ينبغي أن يقمن به، وينهاهن عن ما ينبغي أن يتجنبنه كما فعل النبي محمد ."

            ]
        },
        {
            "name":"صلاة الجنازة",
            "info":[
                "صلاة الجنازة في الإسلام هي صلاة تصلى على الميت غير الشهيد عند المسلمين، وهي فرض كفاية.",
                " يصليها المرء وهو قائم فلا ركوع فيها ولا سجود. وإن كان مأموما اقتدى بالإمام",
                "التكبيرة الأولى: أن يكبر ثم يقرأ الفاتحة.",
                "التكبيرة الثانية: ثم يكبر التكبيرة الثانية ثم يقرأ النصف الأخير من التشهد(الصلاة الإبراهيمية).",
                "التكبيرة الثالثة: ثم يكبر التكبيرة الثالثة ثم يدعو للميت بما شاء من الأدعية ومنها (اللهم اغفر له وارحمه اللهم وسع مدخله اللهم اكرم نزله اللهم مد له في قبره مد بصره اللهم ابدله دارا خيرا من داره واهلا خيرا من اهله اللهم اعف عنه اللهم ارحمه)",
                "التكبيرة الرابعة: ثم يكبر التكبيرة الرابعة ثم يقول ( اللهم لا تحرمنا أجره ولا تَفتِنـّا بعده واغفر اللهم لنا وله) ويدعو للميت ولجميع المسلمين وينهي صلاته بالتسليم."
            ]
        },
        {
            "name":"صلاة التوبة",
            "info":[
                "صلاة التوبة أو صلاة الاستغفار هي من الصلوات المستحبة في الإسلام ولقد هجرها كثير من الناس في وقتنا الحالي",
                "سبب صلاة التوبة هو وقوع المسلمِ في معصية سواء كانت كبيرة أو صغيرة، فيجب عليه أن يتوب منها فوراً، ويندب له أن يصلي هاتين الركعتين، فيعمل عند توبته عملاً صالحاً من أجل القربات وأفضلها، وهو هذه الصلاة ، فيتوسل بها إلى الله تعالى رجاء أن يتقبل توبته، وأن يغفر ذنبه .",
                "فعن أبي بكر الصديق رضي الله عنه قال: سمعت رسول الله ﷺ يقول : ما من عبد يذنب ذنبا فيحسن الطهور ثم يقوم فيصلي ركعتين ثم يستغفر الله إلا غفر له، ثم قرأ هذه الآية:  وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْ وَمَنْ يَغْفِرُ الذُّنُوبَ إِلَّا اللَّهُ وَلَمْ يُصِرُّوا عَلَى مَا فَعَلُوا وَهُمْ يَعْلَمُونَ .",
                "يستحب أداء هذه الصلاة عند عزم المسلم على التوبة من الذنب الذي اقترفه، سواء كانت هذه التوبة بعد فعله للمعصية مباشرة، أو متأخرة عنه، فالواجب على المذنب المبادرة إلى التوبة، لكن إن سوّف وأخّرها قبلت، لأن التوبة تقبل ما لم يحدث أحد من موانعها.",
                " إذا بلغت الروح الحلقوم، قال رسول الله ﷺ: ( إِنَّ اللَّهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ ) حسنه الألباني في صحيح الترمذي",
                " إذا طلعت الشمس من مغربها، قال النبي ﷺ: ( مَنْ تَابَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا تَابَ اللَّهُ عَلَيْهِ ) رواه مسلم ",
                "وهذه الصلاة تشرع في جميع الأوقات بما في ذلك أوقات النهي ( مثل : بعد صلاة العصر ) لأنها من الصلوات التي لها سبب، فتشرع عند وجود سببها .",
                "قال شيخ الإسلام ابن تيمية : (ذوات الأسباب كلها تفوت إذا أخرت عن وقت النهي، مثل سجود التلاوة، وتحية المسجد، و صلاة الكسوف ، ومثل الصلاة عقب الطهارة، كما في حديث بلال، وكذلك صلاة الاستخارة، إذا كان الذي يستخير له يفوت إذا أخرت الصلاة، وكذلك صلاة التوبة، فإذا أذنب فالتوبة واجبة على الفور، وهو مندوب إلى أن يصلي ركعتين، ثم يتوب، كما في حديث أبي بكر الصديق) ."
            ]
        },
        {
            "name":"صلاة التسابيح",
            "info":[
                "هي أربع ركعات بتشهد واحد أو بتسليمتين، وتسمى: صلاة التسابيح أو صلاة التسبيح",
                "صلاة التسابيح هي أربع ركعات يقرأ المصلي في كل ركعة فاتحة الكتاب وسورة، فإن فرغ من القراءة يقول: سبحان الله والحمد لله ولا إله إلا الله والله أكبر خمس عشرة مرة بعد قراءة السورة، ثم يركع فيقول هذا التسبيح وهو راكع عشر مرات، ثم يرفع رأسه من الركوع فيقول هذا التسبيح عشر مرات عند الاعتدال بعد الرفع من الركوع، ثم يهوي ساجدا فيقول هذا التسبيح وهو ساجد عشر مرات، ثم يرفع رأسه من السجود فيقول هذا التسبيح عشر مرات في الجلوس بين السجدتين، ثم يسجد السجدة الثانية فيقوله وهو ساجد عشر مرات، ثم يرفع رأسه فيقوله عشر مرات في الجلوس وهو جلوس الاستراحة وقيل لا بل هو جلوس التشهد حكاه الملا علي القاري في شرح الحديث. فذلك خمس وسبعون في كل ركعة، يفعل ذلك في الأربع ركعات، إن استطاع أن يصليها في كل يوم مرة فافعل، وإلا ففي كل جمعة مرة، وإلا ففي كل شهر مرة، وإلا ففي كل سنة مرة، وإلا ففي العمر مرة.",
                "خمس عشرة بعد الفاتحة والسورة",
                "عشر الركوع",
                "عشر الاعتدال من الركوع",
                "عشر السجود",
                "عشر الجلوس بين السجدتين",
                "عشر السجود الثاني",
                "عشر الجلوس بعد السجدة الثانية"

            ]
        },
        {
            "name":"صلاة الخسوف والكسوف",
            "info":[
                "وهما: سنة مؤكدة، وعددها (ركعتان)، في كل ركعة: قيامان وقراءتان وركوعان وسجودان. ويُسن الخروجُ لأدائها في جماعة، بلا أذان ولا إقامة، بل ينادى لها (الصلاة جامعة). ويندب بعدها أن يخطب الإمام، ويعظ الناس، ويذكرهم بالرجوع إلى الله تعالى. ويستحب مع ذلك أيضا: الإكثار من الذكر والاستغفار والدعاء. ويبدأُ وقت الصلاة من تحقق الكسوف، وينتهي بانجلاء الكسوف أو الخسوف",
                "صلاة خسوف القمر جهرية لأنها صلاة ليلية، وصلاة كسوف الشمس سرّية لأنها صلاة نهارية، ووقتها من ابتداء الكسوف إلى ذهابه ولا تصلى حتى يرى الناس الكسوف لقوله - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -: (إذا رأيتم شيئاً من ذلك فصلوا حتى ينجلي). رواه مسلم.",
                "عن أبي بكرة قال: كنا عند رسول الله ﷺ، فانكسفت الشمس، فقام النبي ﷺ يجر رداءه، حتى دخل المسجد، فدخلنا فصلى بنا ركعتين، حتى انجلت الشمس، فقال ﷺ : إن الشمس والقمر لا ينكسفان لموت أحد، فإذا رأيتموهما فصلوا وادعوا حتى يُكشف ما بكم",
                "هي ركعتان في كل ركعة قيامان وقراءتان وركوعان وسجودان. يقرأ في الأولى الفاتحة وسورة طويلة، ثم يركع طويلاً، ثم يرفع، ولا يسجد، بل يكمل قراءة السورة الطويلة أو يقرأ سورة أخرى دون الفاتحة، ثم يركع، ثم يرفع، ثم يسجد سجدتين طويلتين، ثم يصلى الثانية كالأولى، لكن دونها في كل ما يفعل، ثم يتشهد ويسلم."
            ]
        },
        {
            "name":"صلاة قضاءالحاجة",
            "info":[
                " قال رسول الله: من كانت له إلى الله حاجة أو إلى أحد من بني آدم فليتوضأ فليحسن الوضوء ثم ليصل ركعتين ثم ليثن على الله وليصل على النبي ﷺ، ثم ليقل : لا إله إلا الله الحليم الكريم ، سبحان الله رب العرش العظيم ، الحمد لله رب العالمين ، أسألك موجبات رحمتك ، وعزائم مغفرتك ، والغنيمة من كل بر ، والسلامة من كل إثم ، لا تدع لي ذنبا إلا غفرته ، ولا هما إلا فرجته ، ولا حاجة هي لك رضا إلا قضيتها يا أرحم الراحمين"
            ]
        }
        

      
    ]
}