{
    "salah":[
        {
            "name":"الوضوء",
            "info":[
                "النية والبسملة",
                "غسل الكفين\nبعد أن ينوي المسلم الوضوء بقلبه ويُسمِّ الله يقوم بغسل الكفّين ثلاث مرات، ولا يُعَدُّ غسل الكفّين من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ)، فبدأ بالوجه ولم يَذكَر غسل الكفّين، فغسلُ الكفين يُعَدُّ سنّة من سنن الوضوء لفعل رسول الله -صلّى الله عليه وسلّم- ذلك، فعن حذيفة بن أوسٍ الثقفيّ قال: (رأيتُ رسولَ اللهِ صلَّى اللهُ عليه وسلم استوكفَ ثلاثًا)،أيّ غسل كفّيه ثلاثاً",
                "المضمضة\nبعد أن يغسل المتوضّئ كفّيه يقوم بالمضمضة؛ وهي أن يأخذ حفنةً من الماء و يحرِّكه في فمه ثلاث مرّات، ويليها الاستنشاق؛ وهو أن يأخذ الماء من كفّيه بقوة النَّفس ثلاث مرات، ثمّ الاستنثار؛ وهو إخراج الماء الذي أدخله بالاستنشاق وهو يدفع نَفَسَهُ ثلاث مرات.",
                "غسل الوجه\n بعد أن يتمضمض المتوضّئ ويستنشق ويستنثر يأتي غسل الوجه ثلاثاً؛ وهو واجب من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ)، وغسل الوجه يكون من حدود الوجه من الأعلى إلى الأسفل؛ أيّ من منبت الشعر إلى الذّقن، وإن كان للرّجل لحية كثيفة يقوم بتخليلها بالماء.",
                "غسل اليدين إلى المِرفقين\n بعد غسل الوجه يقوم المتوضّئ بغسل اليدين إلى المِرفقين وهو من واجبات الوضوء فلا يصحُّ الوضوء إلّا به، قال -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ)، ويبدأ غسل اليدين ابتداءً من أطراف الأصابع حتى يصل إلى المرفقين ثلاثاً.",
                "مسح الرأس\nبعد غسل اليدين إلى المِرفقين يأتي مسح الرأس، وهو واجب من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ)، وكيفيّة المسح تكون من مقدّمة الرّأس حتى مؤخرته ويعود ماسحاً من مؤخّرة رأسه إلى المقدمة، ويجوز المسح من مقدمة الرّأس إلى مؤخّرته فقط والمرأة كذلك، ولا تمسح المرأةُ على ظفائرها.",
                "مسح الأذنين\nبعد مسح الرأس يأتي مسح الأذنين ويكون بمسح الأذنين ظاهرهما وباطنهما",
                "غسل القدمين مع الكعبين\nيأتي بعد مسح الأذنين غسل القدمين مع الكعبين، وهو من واجبات الوضوء لقول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ) وكلمة وَأَرْجُلَكُمْ جاءت معطوفةً على وُجُوهَكُمْ و أَيْدِيَكُمْ، فيكون المعنى: فاغسلوا وجهكم وأيديكم وأرجلكم إلى الكعبين. ويؤيّد ذلك قول رسول الله -صلّى الله عليه وسلّم-: (ويلٌ للأعقابِ وبطونِ الأقدامِ من النارِ)، فمن الواجب غسل القدمين من رؤوس الأصابع حتى الكعبين ولا يقلل من ذلك، قد توعّد رسول الله -صلّى الله عليه وسلّم- من يفعل ذلك بالنّار.",
                "ترديد دعاء ما بعد الوضوء وهو: (اللهمَّ اجْعَلْني من التَّوابينَ، واجْعَلْني من المُتطهِّرينَ)",
                "نواقض الوضوء\nالخارج من السبيلين، وهو وحده المتفق على أنه ينقض الوضوء، ويشمل كل خارج من القبل أو الدبر، من: ريح، أو بول، أو براز، أو مني، أو مذي، أو ودي.",
                " التيمم الصحيحة\nيضرب التراب بيديه ضربة واحدة ثم يمسح بهما وجهه وكفيه، كما في الصحيحين أن النبي ﷺ قال لعمار بن ياسر (إنما يكفيك أن تقول بيديك هكذ) ثم ضرب بيديه الأرض ومسح بهما وجهه وكفيه . ويشترط أن يكون التراب طاهرًا.",
                "الغسل من الجنابة\nيغسل كفيه قبل إدخالهما في الإناء ثم يفرغ بيمينه على شماله فيغسل فرجه، ثم يتوضأ وضوءه للصلاة كاملاً أو يؤخر غسل الرجلين إلى آخر الغسل، ثم يفرق شعر رأسه فيفيض ثلاث حثيات من ماء، حتى يروى كله، ثم يفيض الماء على شقه الأيمن، ثم يفيض الماء على شقه الأيسر، هذا هو الغسل الأكمل والأفضل، ودليله ما في الصحيحين من حديث ابن عباس عن خالته ميمونة ـ رضي الله عنهما ـ قالت: أدنيت لرسول الله صلى الله عليه وسلم غسله من الجنابة، فغسل كفيه مرتين أو ثلاثاً، ثم أدخل يده في الإناء، ثم أفرغ به على فرجه وغسل بشماله، ثم ضرب بشماله الأرض فدلكها دلكاً شديداً، ثم توضأ وضوءه للصلاة، ثم أفرغ على رأسه ثلاث حفنات ملء كفه، ثم غسل سائر جسده، ثم تنحى عن مقامه ذلك فغسل رجليه، ثم أتيته بالمنديل فرده."
            ]
        },
        {
            "name":"كيف اصلي",
            "info":[
"قبل البدء بالصلاة ينبغي أن يكون الإنسان على وضوء",
"يستقبل القبلة، ويرفع اليدين بمحاذاة الأذنين، ويكبر للإحرام بالقول (الله أكبر)، ومن ثم يضع الكف اليمنى فوق اليسرى على الصدر، ثم يقرأ دعاء الاستفتاح: (سبحانك اللهم، وبحمدك، تبارك اسمك، وتعالى جدك، ولا إله غيرك). وهذا الدعاء لا يقرأ إلا مرة واحدة فقط بعد تكبيرة الإحرام في بداية الصلاة.",
"يتعوذ المصلي بالله من الشيطان الرجيم، ثم يتلو سورة الفاتحة، ويقول آمين، ويلحقها بما تيسر من آي الذكر الحكيم.",
"يركع بحيث يصير ظهره موازياً للأرض، ويضع يديه على ركبتيه، حيث يقول المصلي أثناء الركوع: (سبحان ربي العظيم) ثلاث مرات.",
"يعتدل من الركوع ويقول (سمع الله لمن حمده)،ويرفع اليدين بمحاذاة الأذنين، ثم يقول (ربنا ولك الحمد حمداً كثيراً طيباً مباركاً فيه).",
"يسجد بحيث تلامس أجزاؤه الثمانية الأرض وهذه الأجزاء هي: الكفان، والركبتان، وأطراف أصابع القدمين، بالإضافة إلى الأنف، والجبهة. *يقول المصلي أثناء السجود: (سبحان ربي الأعلى) ثلاث مرات.",
"يرتفع من سجوده وهو يقول الله أكبر، ثم يجلس بين السجدتين ويقول (رب اغفر لي) ثلات مرات، ويعاود السجود مرة أخرى",
"بعد السجدة الثانية، إن كان المصلي في الركعة الثانية أو الأخيرة من الصلاة يستمر في جلوسه، ثم يتشهد فيقول: (التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمداً عبده ورسوله)، ثم يقرأ الصلاة الإبراهيمية: (اللهم صلِّ على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد)، وإن كان في الركعة الثانية توقف عند التشهد، ويرفع اليدين بمحاذاة الأذنين، ووقف،ثم يقراء سوره الفاتحه فقط وياكمل صلاته إلى نهايتها، أما لو كان جالساً في آخر ركعة فإنه يسلم بعد الصلاة الإبراهيمية، حيث يدير رأسه على اليمين ويقول: (السلام عليكم ورحمة الله وبركاته)، ثم يدير رأسه على اليسار ويقول: (السلام عليكم ورحمة الله)، أما لو لم يكن في الركعة الثانية أو الأخيرة من الصلاة فينهض بعد السجدة الثانية ويعيد الخطوات السابقة."
            ]
        },
        {
            "name":"صلاة الفريضه",
            "info":[
                "عند البدء بصلاة الفرض أنّه ينوي صلاة الفريضة إماماً أو مأموماً أو مُنفرداً",
                "صلاة الفجر\nعداد الركعات : 2 \nعداد ركعات السنه : 2\nركعتين قبل الفجر",
                "صلاة الظهر \nعداد الركعات : 4 \nعداد ركعات السنه : 4\nركعتين قبل الظهر وركعتين بعد الظهر",
                "صلاة العصر \nعداد الركعات : 4 \nعداد ركعات السنه : 0",
                "صلاة المغرب \nعداد الركعات: 3 \n عداد ركعات السنه : 2\nركعتين بعد المغرب ",
                "صلاه العشاء\nعداد الركعات: 4 \nعداد ركعات السنه : 2 \nركعتين بعد العشاء"
            ]
        },
        {
            "name":"صلاة القيام",
            "info":[
                "تُؤدّى صلاة قيام الليل ركعتَين ركعتَين؛ لِما ثبت ذلك في السنّة النبويّة عن عبدالله بن عمر -رضي الله عنهما- أنّ النبيّ -عليه الصلاة والسلام- قال: (صَلاةُ اللَّيْلِ مَثْنَى مَثْنَى، فإذا رَأَيْتَ أنَّ الصُّبْحَ يُدْرِكُكَ فأوْتِرْ بواحِدَةٍ. فقِيلَ لاِبْنِ عُمَرَ: ما مَثْنَى مَثْنَى؟ قالَ: أنْ تُسَلِّمَ في كُلِّ رَكْعَتَيْنِ)، وقال أيضاً: (أنَّ رسولَ اللهِ صلَّى اللهُ تعالَى عليه وسلم قال: صلاةُ الليلِ والنهارِ مثنَى مثنَى).",
                "ويُستحسن بالمسلم خَتْم قيام الليل بأداء الوتْر، كما ورد في صحيح البخاريّ أنّ النبيّ -عليه الصلاة والسلام-: (اجْعَلُوا آخِرَ صَلَاتِكُمْ باللَّيْلِ وِتْرًا)،والتسليم مطلوبٌ بين الركعتين في صلاة القيام، ولا تكون الصلاة على شكل صلاتي الظُّهر، أو العصر؛ اقتداءً بفَعْل النبيّ -عليه الصلاة والسلام ",
                "استناداً لما أخرجه الإمام مُسلم في صحيحه، عن أمّ المؤمنين عائشة -رضي الله عنها- أنّها قالت: (كانَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ يُصَلِّي فِيما بيْنَ أَنْ يَفْرُغَ مِن صَلَاةِ العِشَاءِ، وَهي الَّتي يَدْعُو النَّاسُ العَتَمَةَ، إلى الفَجْرِ، إحْدَى عَشْرَةَ رَكْعَةً، يُسَلِّمُ بيْنَ كُلِّ رَكْعَتَيْنِ، وَيُوتِرُ بوَاحِدَةٍ، فَإِذَا سَكَتَ المُؤَذِّنُ مِن صَلَاةِ الفَجْرِ، وَتَبَيَّنَ له الفَجْرُ، وَجَاءَهُ المُؤَذِّنُ، قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ اضْطَجَعَ علَى شِقِّهِ الأيْمَنِ، حتَّى يَأْتِيَهُ المُؤَذِّنُ لِلإِقَامَةِ)."
            ]
        },
        {
            "name":"صلاة الضحي",
            "info":[
"تؤدى بعد طلوع الشمس بنحو 20 دقيقة إلى قبيل الظهر، وحكم صلاة الضحى أنها سنة مؤكدة عند الجمهور، وأقلها ركعتان، وأوسطها أربع ركعات، وأفضلها ثماني ركعات، وأكثرها اثنتا عشرة ركعة، وفضلها تعد صدقة عن مفاصل الجسم البالغة نحو 360 مفصلًا، وذكر بعض العلماء أن الرسول -صلى الله عليه وسلم- كان يصلي صلاة الضحى، ولكنه لا يداوم عليها، خشية أن يعمل الناس مثله فتفرض عليهم، وأنه كان منشغلاً بقيام الليل الذي كان فرضًا عليه كما ذهب إلى ذلك بعض العلماء."
            ]
        },
        {
            "name":"صلاة الاستخارة",
            "info":[]
        }

      
    ]
}